Table of Contents
 Class CheckResAnchor
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Check value for Anchor
[Serializable]
[DataContract]
public class CheckResAnchor
Inheritance
object
CheckResAnchor
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CheckStatus
Status of the Check
[DataMember]
public bool CheckStatus { get; set; }
Property Value
bool
 LoadCaseId
Id of Load Case
public int LoadCaseId { get; set; }
Property Value
int
 Name
Name
[DataMember]
public string Name { get; set; }
Property Value
string
 UnityCheck
Unity Check
[DataMember]
public double UnityCheck { get; set; }
Property Value
double
 Edit this page